export const list = [
  {
    q: 'Мне нужно приложение для iOS и Android. С какой платформы лучше начать?',
    a: `Для начала, вам необходимо определить бюджет, который вы закладываете на разработку приложения, а также функционал.

    Далее, в зависимости от бюджета и функционала можно выбирать между нативной и кроссплатформенной разработкой мобильных приложений.
    
    Если сравнивать кроссплатформенную и нативную разработку, то можно сказать о том, что оба подхода обеспечивают высокую масштабируемость и качественный пользовательский интерфейс.
    
    Однако, реализация вашего приложения с помощью кроссплатформенных технологий происходит быстрее, так как кодовая база реализуется сразу для двух платформ. Такой подход подойдет, если вам необходимо как можно быстрее запустить MVP-версию приложения при учёте невысоких затрат на разработку.
    
    В отличие от кроссплатформенных инструментов, разработка нативных приложений зависит от приложений Android или iOS. Нативные приложения написаны на языках, поддерживаемых поставщиком ОС устройства.
    
    Как правило, в нативных приложениях пользователи могут в полной мере использовать сложные функции, которые задействуют аппаратную часть устройства.`,
  },
  {
    q: 'Вы даёте гарантию на мобильное приложение?',
    a: 'Да, гарантия на приложение — от 1 до 3 месяцев, в зависимости от нашей с вами договоренности. В течение этого времени бесплатно устраним ошибки, которые вы найдёте. Одно условие — исходный код программы должен быть без изменений.',
  },
  {
    q: 'У меня есть недоработанное приложение. Вы можете его доработать?',
    a: `Мы доработаем ваше приложение, при условии, что стек технологий, на котором реализовано приложение, совпадает с нашим. Для этого понадобятся первичные требования, макеты дизайна и исходный код.

    Мы изучим документацию, проведём ревью макетов и кода приложения. Мы поймём состояние проекта, дадим заключение и оценку трудозатрат на доработку приложения.`,
  },
  {
    q: 'Сколько стоит разработка приложения?',
    a: `Существует две наиболее распространенные модели финансового взаимодействия между заказчиком и компанией - разработчиком - это Fixed Price и Time&Materials.

    Fixed Price - цена на проект фиксирована и чаще всего используется в проектах с четко зафикcированным функционалом.
    
    Обычно, в проекты, которые реализуются по схеме Fixed Price, после того, как договор уже был подписан, очень сложно внести изменения или дополнения.
    
    Time and Materials (T&M) - такой тип договорных отношений, предполагает, что работа будет оплачена по факту её выполнения, при этом команде разработке предварительно необходимо проанализировать проект на предмет того, какие задачи необходимо реализовать, а также дать предварительную оценку.
    
    Схема T&M позволяет заказчику вносить изменения в требования, а команде разработки безболезненно их реализовывать.`,
  },
  {
    q: 'Сколько времени потребуется на разработку мобильного приложения/web-приложения?',
    a: `Как и стоимость реализации, сроки выполнения сильно зависят от ваших требований и пожеланий, после формирования первичных требований мы согласовываем с вами сроки и даты реализации проекта.

    Как правило, реализация проекта может занять от 2 месяцев до 1 года, в зависимости от его сложности. Некоторые проекты, в которых веб-приложения или мобильные приложения должны быть интегрированы со сторонними системами, такими как платежные шлюзы, могут занять больше времени на реализацию.`,
  },
  {
    q: 'Как я могу контролировать процесс разработки продукта?',
    a: `На каждый проект назначается менеджер, который регулярно общается с вами, держит вас в курсе и отвечает на ваши вопросы.

    Менеджер связывается с вами каждую неделю и высылает отчет о проведенной за неделю работе.
    
    Также раз в 3-4 недели (по договоренности) мы предоставляем вам актуальную версию вашего проекта: файл для сборки на мобильных устройствах или ссылку на стенд для web-приложений.`,
  },
]
